Antigravity Code Editor extensions IDs list.

13xforever.language-x86-64-assembly
bbenoist.doxygen
bierner.markdown-mermaid
britesnow.vscode-toggle-quotes
cheshirekow.cmake-format
cschlosser.doxdocgen
cweijan.vscode-office
devsense.intelli-php-vscode
donjayamanne.githistory
editorconfig.editorconfig
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
franneck94.c-cpp-runner
franneck94.vscode-c-cpp-config
franneck94.vscode-c-cpp-dev-extension-pack
github.vscode-github-actions
golang.go
gruntfuggly.todo-tree
humao.rest-client
jeff-hykin.better-cpp-syntax
kevinrose.vsc-python-indent
kisstkondoros.vscode-gutter-preview
kylinideteam.cmake-intellisence
kylinideteam.cppdebug
kylinideteam.kylin-clangd
kylinideteam.kylin-cmake-tools
kylinideteam.kylin-cpp-pack
llvm-vs-code-extensions.vscode-clangd
mathiasfrohlich.kotlin
mermaidchart.vscode-mermaid-chart
meta.pyrefly
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.autopep8
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-python-envs
ms-vscode.cmake-tools
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
ms-vscode.powershell
muhammad-ahmad.xlsx-viewer
oven.bun-vscode
pkief.material-icon-theme
pleno.pleno-language
redhat.java
redhat.vscode-xml
redhat.vscode-yaml
rid9.datetime
ritwickdey.liveserver
rust-lang.rust
rust-lang.rust-analyzer
tamasfe.even-better-toml
tauri-apps.tauri-vscode
twxs.cmake
vadimcn.vscode-lldb
vincaslt.highlight-matching-tag
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vue.volar
zignd.html-css-class-completion
